Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Pfähle aus Metall
en: Posts of metal

source: Gräber aus Metall
en: Tombs of metal

source: Grabkammern aus Metall
en: Burial vaults of metal

source: Roher oder teilweise bearbeiteter Stahl
en: Steel, unwrought or semi-wrought

source: Weißblech
en: Tinplate

source: Behälter aus Metall für Druckgase oder flüssige Luft
en: Containers of metal for compressed gas or liquid air

source: Metallflaschen für Druckgas oder flüssige Luft
en: Bottles [metal containers] for compressed gas or liquid air

source: Rohes oder teilweise bearbeitetes Kupfer
en: Copper, unwrought or semi-wrought

source: Bodenfliesen aus Metall
en: Tile floorings of metal

source: Muffen [Kleineisenwaren]
en: Sleeves [metal hardware]

source: Schweißdraht aus Metall
en: Soldering wire of metal

source: Ortsfeste Toilettenpapierspender aus Metall
en: Toilet paper dispensers, fixed, of metal

source: Warmgewalzte Stahlrohre
en: Hot-rolled steel tubes

source: Wandhalterungen aus Metall für Rohre
en: Wall hooks of metal for pipes

source: Ohrmarken aus Metall für Nutztiere
en: Metal ear tags for livestock

source: Zeltstangen aus Metall
en: Tent poles of metal

source: Kupferplatten für die Herstellung von Leiterplatten
en: Copper panels for the manufacture of circuit boards

source: Sechskantschrauben aus Metall
en: Metal hexagon head bolts

source: Ladebrücken aus Metall [Konstruktionen]
en: Metal loading ramps [structures]

source: Metallrahmen für Autokennzeichen
en: Metal license plate frames

source: Nummernschildbefestigungen aus Metall
en: Metallic numberplate fasteners

source: Hakencontainer aus Metall
en: Hooklift containers of metal

source: Metalle in Pulverform für 3D-Drucker
en: Metals in powder form for 3D printers

source: Verglaste Türen aus Metall
en: Glazed doors of metal

source: Bergbaubohrer [Maschinen]
en: Mine borers [machines]

source: Kleine Bagger
en: Mini excavators

source: Elektrische Küchenmesser
en: Kitchen knives (Electric -)

source: Waschanlagen für Fahrzeuge
en: Washing installations for vehicles

source: Spannköpfe in Form von Maschinenteilen
en: Tensioning heads being parts of machines

source: Nockenwellen für Wasserfahrzeuge
en: Camshafts for water vehicles

source: Pflugscharen für Fahrzeuge
en: Plough blades for vehicles

source: Kurbelwellen
en: Crank shafts

source: Mechanische schienengebundene Hubförderer
en: Mechanical railed lifting conveyors

source: Pumpen [Maschinen] für die Getränkeindustrie
en: Pumps [machines] for the beverage industry

source: Polierscheiben für elektrische Fußbodenpoliermaschinen
en: Polishing discs for use with electric floor polishers

source: Elektrische Polierwerkzeuge
en: Polishing tools (Electric -)

source: Lithografische Druckmaschinen
en: Lithographic printing machines

source: Lader für landwirtschaftliche Maschinen
en: Loaders for agricultural machines

source: Winden [Maschinen]
en: Winching machines

source: Kraftstoffeinspritzsysteme für Motoren
en: Fuel injection systems for engines

source: Kraftstoffeinspritzvorrichtungen für Verbrennungsmotoren
en: Fuel injectors for internal combustion engines

source: Elevatorketten [Teile von Maschinen]
en: Elevator chains [parts of machines]

source: Strohschneider [ausgenommen handbetätigte Werkzeuge]
en: Cutters for straw [other than hand-operated tools]

source: Schneidevorrichtungen als Teile von Maschinen
en: Cutting devices being parts of machines

source: Magnethalterungen für Werkzeugmaschinen
en: Magnetic holders for machine tools

source: Elektrischer Antriebsmechanismus für Maschinen
en: Electric propulsion mechanisms for machines

source: Pressfilze für Papierherstellungsmaschinen
en: Press fabric for paper making machines

source: Roboter zur Weiterleitung von Werkstücken
en: Robots for transferring workpieces

source: Roboter mit Gelenkarmen zur Handhabung von Werkstücken
en: Robots with articulated arms for manipulating workpieces

source: Salatschleudern [elektrische Küchenmaschinen]
en: Salad drainers [electric kitchen machines]

source: Elektrische Schärfer
en: Electric sharpeners

source: Streumaschinen für Dünger
en: Fertilizer spreading machines

source: Pressen [Maschinen] für Faserplatten
en: Fibreboard presses [machines]

source: Gebläse zum Komprimieren, Ansaugen und für den Transport von Gasen
en: Blowing machines for the compression, exhaustion and transport of gases

source: Griffe für Gangschalthebel, ausgenommen für Landfahrzeuge
en: Gear change knobs, other than for land vehicles

source: Zahnradfräser [Maschinen]
en: Gear cutters [machines]

source: Spulen [Teile von Verbrennungsmotoren]
en: Coils [internal combustion engine parts]

source: Schneefräsenaufsätze für Fahrzeuge
en: Snow blowing attachments for vehicles

source: Schneeräumaufsätze für Fahrzeuge
en: Snow moving attachments for vehicles

source: Kupplungszylinder, ausgenommen für Landfahrzeuge
en: Clutch cylinders, other than for land vehicles

source: Bohrmaschinen und -geräte
en: Power drills and bores

source: Elektrische Schaltgetriebe [ausgenommen für Landfahrzeuge]
en: Power shift transmissions [other than for land vehicles]

source: Kraftübertragungsteile [ausgenommen für Landfahrzeuge]
en: Power transmission parts [other than for land vehicles]

source: Rasenwalzgeräte zum Befestigen an Landfahrzeuge
en: Lawn rolling implements for attachment to land vehicles

source: Rasenkehrmaschinen [Maschinen]
en: Lawn sweepers [machines]

source: Schaufellader [Erdbewegungsmaschinen]
en: Loaders [earth moving machines]

source: Schürfzüge [Erdbewegungsmaschinen]
en: Scrapers [earth moving machines]

source: Elektrische Küchenmaschinen zum Hacken, Mischen, Pressen
en: Electric kitchen appliances for chopping, mixing, pressing

source: Ansaugkrümmer [Fahrzeugteile]
en: Intake manifolds [vehicle parts]

source: Schüttelmaschinen für die Produktion
en: Shaking machines for use in manufacture

source: Elektrische Formmaschinen
en: Shaping machines [electric]

source: Elektrische Messerschleifmaschinen
en: Sharpening machines for blades (Electric -)

source: Drehmomentwandler, ausgenommen für Landfahrzeuge
en: Torque converters, other than for land vehicles

source: Pneumatische Rohrförderanlagen
en: Pneumatic tube conveyors

source: Pressdeckel für Druckereimaschinen
en: Tympans [parts of printing presses]

source: Druckmaschinen
en: Printing machines

source: Hydraulische Drehmomentwandler [Motorenteile, ausgenommen für Landfahrzeuge]
en: Hydraulic torque converters [machine elements not for land vehicles]

source: Stirnräder [Maschinenteile]
en: Spur wheels [parts of machines]

source: Gussteile für Rohre [Maschinenteile]
en: Cast iron parts for pipes [parts of machines]

source: Maschinen zum Gießen von Keramik
en: Casting machines for ceramics

source: Gießmaschinen für geschmolzenes Metall
en: Casting machines for molten metal

source: Entpalettierer [Maschinen]
en: Depalletisers [machines]

source: Diamant-Bohreinsätze für Maschinen
en: Diamond drill bits for machines

source: Zylinder für Farbbearbeitungsmaschinen
en: Cylinders for use in the manufacture of colorants

source: Rechen für Heuwendemaschinen
en: Rakes for raking machines

source: Behälter für Schrägförderanlagen
en: Buckets for elevator conveyors

source: Siebe für die Zellstoffindustrie [Maschinenteile]
en: Screens used in the pulp industry [parts of machines]

source: Schraubenzieher [Maschinen]
en: Screw extractors [machines]

source: Werkzeughalter für Metallbearbeitungsmaschinen [Maschinenteile]
en: Toolholders for metalworking machines (machine parts)

source: Holzspalter [Maschinen]
en: Log splitters [machines]

source: Baumscheren [Maschinen]
en: Lopping shears [machines]

source: Einstellmaschinen für Sägezähne [für Sägen zum Holzfällen und -bearbeiten]
en: Saw-tooth setting machines [for lumbering or woodworking saws]

source: Förderbänder aus Draht
en: Conveyor belts made of wire

source: Kompressoren [Verdichter] für Müllsammelfahrzeuge
en: Compressors [compactors] for waste collection vehicles

source: Verbindungsmaschinen [Mischmaschinen]
en: Contacting machines [mixing machines]

source: Kurbelwellengehäuse für Landfahrzeugmotoren
en: Crankcases for land vehicles engines

source: Durch das Stromnetz oder Batterien angetriebene Schneidemaschinen
en: Cutters being powered by mains electricity or batteries

source: Kraftübertragungsvorrichtungen für Schiffe
en: Power transmissions for water vehicles

source: Präzisionskehlwerkzeuge [Maschinen]
en: Precision grooving tools [machines]

source: Präzisionskehlwerkzeuge [Maschinenteile]
en: Precision grooving tools [parts of machines]

source: Präzisionswerkzeugmaschinen als Teile von Anlagen
en: Precision machine tools being parts of sets

source: Vorisolierte verstärkte Metallrohre [angepasste Maschinenteile]
en: Pre-insulated bonded metal pipes [fitted parts of machines]

source: Vorisolierte verstärkte Rohre, nicht aus Metall [Maschinenteile]
en: Pre-insulated bonded pipes (non-metallic -) [parts of machines]

source: Halbleiterbearbeitungsmaschinen zur Herstellung von Magnetplatten
en: Semiconductor processing machines for the manufacture of magnetic disks

source: Servogesteuerte Hydraulikpumpen
en: Servo-controlled hydraulic pumps

source: Elektrische Gemüseschäler
en: Electric vegetable peelers

source: Lagerböcke für Maschinen
en: Bearing brackets for machines

source: Maschinen für die Herstellung von Eiscreme [gewerblich]
en: Machines for use in making ice cream [industrial]

source: Maschinen [Pumpen] für die Wasserbearbeitung
en: Machines for use in the processing of water

source: Ferngesteuerte Hebemaschinen
en: Remotely controlled lifting machines

source: Pneumatische Handbohrer
en: Pneumatic drills [hand-held]

source: Elektrisch betriebene Töpferscheiben
en: Power-operated potters' wheels

source: Pressformen für die Metallumformung
en: Press dies for metal forming

source: Generatoren für Fahrzeuge
en: Power generators for vehicles

source: Elektrisch betriebene Bootheber
en: Power-operated boat lifts

source: Lagerzapfen [Maschinenteile]
en: Journals [parts of machines]

source: Aschensiebe [Maschinen]
en: Cinder sifters [machines]

source: Viehschergeräte [Maschinen]
en: Cattle shearers [machines]

source: Sinterhartmetallwerkzeuge [Drucken]
en: Cemented carbide tools [machine]

source: Hebeanlagen [ausgenommen Skilifte]
en: Lifting installations [other than ski lifts]

source: Butterfässer [Maschinen] zur Herstellung von Butter
en: Churns [machines] for use in making butter

source: Kreissägeblätter als Maschinenteile
en: Circular saw blades being parts of machines

source: Motoren für Luftkissenfahrzeuge
en: Engines for air cushion vehicles

source: Schaufelbagger [Maschinen]
en: Mechanical shovels [machines]

source: Schleifeinsätze für Maschinen
en: Abrading inserts for use with machines

source: Heftmaschinen für gewerbliche Zwecke
en: Collating machines for industrial use

source: Kombinierte Wasch- und Bürstmaschinen
en: Combined washing and brushing machines

source: Elektrische Besen
en: Electric brooms

source: Reinigungsmaschinen für Teiche
en: Cleaning machines for ponds

source: Schneidwerkzeuge in Form von Gasschweißbrennern
en: Cutting tools being gas-operated blow pipes

source: Zyklone für die Teilchensammlung bei Schleifvorgängen
en: Cyclones for particle collection in grinding operations

source: Dieselmotoren für Wasserfahrzeuge
en: Diesel engines for water vehicles

source: Differentialgetriebe für Seefahrzeuge
en: Differential gear mechanisms for sea craft

source: Kohlebürsten für Dynamos
en: Carbon brushes for dynamos

source: Rohrförderanlagen [hydraulisch]
en: Tube conveyors, hydraulic

source: Rohre als montierte Maschinenteile
en: Tubes being fitted parts of machines

source: Kraftübertragungsriemen für industrielle Anwendungen
en: Transmission belts for industrial applications

source: Transportfördergeräte für kastenlose Gussteile in Gießereien
en: Transport conveyors for boxless mould parts in foundries

source: Transportförderanlagen für Formen in Gießereien
en: Transport conveyors for moulds in foundries

source: Zahnradfräser [Werkzeugmaschinen]
en: Gear cutters [machine tool]

source: Bohrmaschinen [für die Metallbearbeitung]
en: Drilling machines [for metalworking]

source: Elektrische Waschmaschinen für industrielle Zwecke
en: Electric washing machines for industrial purposes

source: Elektrostatische Generatoren
en: Electrostatic generators

source: Kolben für Motoren
en: Pistons for engines

source: Spülmaschinen für Küchenschüsseln
en: Washing machines for kitchen bowls

source: Geräte zum Pressen von Abfall [Maschinen]
en: Waste compaction apparatus [machines]

source: Strichcodedrucker [Maschinen]
en: Bar code printers [machines]

source: Heckenscheren [Maschinen]
en: Hedge trimmers [machines]

source: Blasebälge [Maschinenteile]
en: Bellows [parts of machines]

source: Förderbänder zum Transportieren von losen Granulaten
en: Belt conveyors for handling loose granular goods

source: Förderbänder mit einer teilweise gekrümmten Achse
en: Belt conveyors having a partially curved axis

source: Druckventile [Maschinenteile]
en: Pressure valves [parts of machines]

source: Siebe [Maschinen oder Maschinenteile]
en: Sieves [machines or parts of machines]

source: Elektrische Zündungen [ausgenommen Fernzündungen]
en: Electric ignition devices [other than for igniting at a distance]

source: Düngemittelverteiler [Maschinen] für Reihen
en: Row fertiliser spreaders [machines]

source: Geschirrspülmaschinen für gewerbliche Zwecke
en: Dish washing machines for industrial purposes

source: Bohrgeräte für die Bergbauindustrie
en: Drills for the mining industry

source: Dungverteiler [traktorgezogene landwirtschaftliche Geräte]
en: Manure spreaders [tractor towed agricultural implements]

source: Traktorgezogene Düngemittelstreuer
en: Tractor-towed fertilizer applicators

source: Wasserpumpen zum Belüften von Teichen
en: Water pumps for aerating ponds

source: Presswerkzeuge [Maschinenteile]
en: Press tools [parts of machines]

source: Spindeladapterflansche für Werkzeugmaschinen
en: Spindle adapter flanges for machine tools

source: Backpressen [Maschinen]
en: Bench presses [machines]

source: Werkzeuge zur Wirkungsverstärkung beim Bohren von Erdölbohrlöchern
en: Impact enhancing tools for use in the drilling of oil wells

source: Kantenhobel [Maschinen]
en: Edging tools [machines]

source: Wassererhitzer [Maschinenteile]
en: Water heaters [parts of machines]

source: Schleppbare Sprühapparate für landwirtschaftliche Zwecke
en: Towable spraying apparatus for agricultural use

source: Maschinen zur Bearbeitung von Gegenständen mit Prozessgasen
en: Processing machines using processing gases for the treatment of objects

source: Bohranlagen für Offshore-Bohrungen
en: Drilling rigs for drilling off-shore wells

source: Gewerbliche Waschmaschinen
en: Industrial washing machines

source: Bremskomponenten für Maschinen
en: Braking components for machines

source: Fahrbare Schwingförderer
en: Movable vibrating conveyors

source: Zerstäuber für Insektizide [Maschinen]
en: Sprayers (insecticide -) [machines]

source: Hobelmaschinen [zur Metallbearbeitung]
en: Planing machines [for metalworking]

source: Kupplungen aus Metall für Hydraulikgeräte
en: Couplings of metal for hydraulic apparatus

source: Elektrische Stichsägen
en: Power-operated jig saws

source: Kompressoren für Entfeuchtungsmaschinen
en: Compressors for dehumidifying machines

source: Vertikale Kübelförderbänder
en: Vertical bucket conveyors

source: Vibrierende Abscheider [Maschinen]
en: Vibrating separators [machines]

source: Trichter [Maschinen]
en: Hoppers [machines]

source: Gewindefräser [Elektrowerkzeuge]
en: Thread mills [power tools]

source: Lagergehäuse [Maschinenteile]
en: Bearing housings [machine parts]

source: Mechanische Mischmaschinen
en: Mechanical mixing machines

source: Elektrische Messer
en: Knives, electric

source: Elektrogeneratoren für Schiffe
en: Electric power generators for ships

source: Elektrische Maschinenantriebe
en: Electrical drives for machines

source: Antriebe für elektrische Generatoren
en: Electric generator power sets

source: Steinsiebgeräte [Maschinen]
en: Stone screening apparatus [machines]

source: Strohverteilgeräte [Maschinen]
en: Straw bale spreaders [machines]

source: Spitzen für Bohreinsätze [Maschinenteile]
en: Tips for tool bits [parts of machines]

source: Mehrfachhalterungen [Maschinenteile]
en: Multiple shell grippers [machines]

source: Elektrische Getriebemotoren für Wasserfahrzeuge
en: Geared electric motors for water craft

source: Erdbohrer [Maschinen]
en: Augers [machines]

source: Pumpen für Aerosole
en: Pumps for aerosols

source: Elektrische Küchenmaschinen zur Herstellung von Schlagsahne
en: Machines for use in making whipped cream [electric, kitchen]

source: Elektrische Waschmaschinen für Bekleidungsstücke
en: Machines for washing clothing [electric]

source: Reversible Durchflussfilter [Maschinenteile]
en: Reversible flow filters [parts of machines]

source: Führungsrahmen für Werkzeugmaschinen
en: Guidance frameworks for machine tools

source: Papierschneidemaschinen, ausgenommen für Bürozwecke
en: Guillotine machines, other than for office use

source: Spritzmaschinen zum Auskleiden von Öfen
en: Gunning machines for lining furnances

source: Hydraulische Hebezeuge
en: Hydraulic lifting gear

source: Weichen [Teile von Zündvorrichtungen für Verbrennungsmotoren]
en: Points [ignition parts for internal combustion engines]

source: Gelochte Siebe als Teile von Maschinen für die Materialsortierung
en: Perforated screens being parts of machines for sorting of materials

source: Druckmaschinen für Banknoten
en: Printing machines for bank notes

source: Druckmaschinen für elektrische Vervielfältigungsprozesse
en: Printing machines for electric duplicating processes

source: Gewerbliche Reinigungsmaschinen [Poliermaschinen]
en: Industrial cleaning machines [polishers]

source: Werkzeuge zum Formen von Rollen [Maschinenteile]
en: Roll forming tooling [parts of machines]

source: Antriebsmechanismen für Motoren [ausgenommen für Landfahrzeuge]
en: Motor drive mechanisms [other than for land vehicles]

source: Heftgeräte [Maschinen]
en: Tackers [machines]

source: Teepflücker [Maschinen]
en: Tea leaf pickers [machines]

source: Elektrische Gartenmaschinen
en: Gardening machines (Powered -)

source: Ultraschallreinigungsgeräte für gewerbliche Zwecke
en: Ultrasonic cleaning instruments for industrial use

source: Entladetrichter [Maschinenteile]
en: Hoppers [mechanical discharging]

source: Läppmaschinen [für die Metallbearbeitung]
en: Lapping machines [for metalworking]

source: Hebevorrichtungen zur Beförderung von Personen und Gütern
en: Lifting installations for the transport of persons and goods

source: Amphibische Bulldozer
en: Amphibious bulldozers

source: Sprühmaschinen zur Anbringung an Traktoren
en: Spraying machines for use mounted on tractors

source: Auf Anhängern montierbare Spritzmaschinen
en: Spraying machines for use mounted on trailers

source: Stapelmaschinen für Platten
en: Stacking machines for slabs

source: Standardschaftbohrer [Maschinen]
en: Standard shank drills [machines]

source: Ständer für Hebetische
en: Stands for lifting tables

source: Stanzwerkzeuge [Maschinenteile], ausgenommen Büroartikel
en: Punching tools [parts of machines], other than office requisites

source: Gleitschlitten für Werkstücke [Maschinen]
en: Workpiece slide tables [machines]

source: Öffner für Schraubverschlüsse [Maschinen]
en: Screw threaded cap openers [machines]

source: Auf Anhänger montierte landwirtschaftliche Geräte
en: Agricultural implements being trailer mounted

source: Schnurlose Elektrohandwerkzeuge
en: Hand held cordless power tools

source: Schneebesen [elektrische Maschinen] für industrielle Zwecke
en: Whisks [electric machines] for industrial purposes

source: Drahtkettenriemen für Maschinen
en: Wire chain belts for machines

source: Filter [Teile von Maschinen oder Motoren]
en: Filters [parts of machines or engines]

source: Antriebsmechanismen für Werkzeugmaschinen
en: Drive mechanisms for machine tools

source: Stichsägeblätter [Maschinenteile]
en: Jigsaw blades [parts for machines]

source: Bohrroboter für Reparaturen im Inneren von Rohren
en: Boring robots for repairing the interiors of pipes

source: Bohrer [Werkzeugmaschinen]
en: Boring tools [machine tools]

source: Über Geländeniveau ausfahrbare maschinenbetriebene Hubplattformen zur Verwendung im Lagerbetrieb
en: Machine operated platforms capable of elevation above ground level and used for storage

source: Turbinenschaufeln für Luftfahrzeuge
en: Blades for aircraft turbines

source: Messer für Elektrohobel
en: Blades for powered planes

source: Staubsauger zur Reinigung von Oberflächen
en: Vacuum cleaners for the cleaning of surfaces

source: Hochleistungsgebläse für Rasenmäher
en: Power blowers for lawn debris

source: Filzscheiben als Maschinenteile zur Verwendung bei Scheuerarbeiten
en: Non-woven wheels being parts of machines for use in scouring

source: Riemenscheiben mit Lagern [Maschinenteile]
en: Pulleys incorporating bearings [parts of machines]

source: Bauteile für Pumpenmotoren
en: Pump-motor assemblies

source: Steuerbare Aushubmaschinen zur Erdversetzung
en: Steerable excavating machinery for earth displacement

source: Spritzschutz [Maschinenteile]
en: Splash preventers [parts of machines]

source: Keilwellenbits [Getriebeteile für Luftfahrzeuge]
en: Spline shank bits [parts of gearing for aircraft]

source: Lichtunempfindliche Druckplatten
en: Printing plates [not sensitised]

source: Maschinenkupplungen [ausgenommen Rohre]
en: Machine couplings [other than pipe]

source: Maschinenführungen [Maschinenteile]
en: Machine guides [parts of machines]

source: Rollmaschinen [Förderer]
en: Rolling [conveying] machines

source: Abstellmechanismen als Maschinenteile
en: Disengaging mechanisms being parts of machines

source: Fettfilter [Maschinenteile]
en: Grease filters [parts of machines]

source: Gewerbliche Bodenreinigungsmaschinen [Staubsauger]
en: Industrial floor cleaning machines [vacuum cleaners]

source: Motorplanierer [Maschinen]
en: Motor graders [machines]

source: Vorrichtungen zur Beförderung von Waren
en: Assembly nests for conveying goods

source: Zerstäuber als Teile für landwirtschaftliche Spritzmaschinen für Feldfrüchte
en: Atomisers being parts for agricultural crop spraying machines

source: Anbauteile für Bagger
en: Attachments for excavators

source: Sprühdüsen für den Anschluss an Druckwaschmaschinen
en: Spray nozzles for attachment to pressure washing machines

source: Spritzwalzen als landwirtschaftliche Geräte
en: Spray rollers being agricultural implements

source: Druckverstärker für Flüssigkeiten
en: Pressure multipliers for liquids

source: Felsbrechhämmer [Maschinen]
en: Breakrock hammers [machines]

source: Schalldämpfer als Teile von Auspuffanlagen von Fahrzeugen
en: Sound absorbers [silencers] being parts of vehicle exhaust systems

source: Funkenfänger als Maschinenteile
en: Spark arrestors being parts of machines

source: Nockenantriebssysteme für Verbrennungsmotoren
en: Cam drive systems for internal combustion engines

source: Motorbetriebene Wasserpumpen
en: Engine driven water pumps

source: Motoren für Kompressoren
en: Engines for compressors

source: Bagger für hydraulische Expansionsmaschinen
en: Excavators for hydraulic expansion machines

source: Nockenwellen für Luftfahrzeuge
en: Camshafts for air vehicles

source: Riemen für Maschinen
en: Belts for machines

source: Bohrköpfe [Maschinenteile]
en: Drilling heads [parts of machines]

source: Zündvorrichtungen für Verbrennungsmotoren
en: Igniting devices for internal combustion engines
